## Plan Result (demo-uksouth-demo)




<pre><code>Plan: 22 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.demo-platform.azurerm_dns_a_record.this[&#34;pip-frontend&#34;]
  * module.demo-platform.azurerm_dns_a_record.this[&#34;tax-tribunals&#34;]
  * module.demo-platform.azurerm_dns_a_record.this[&#34;tax-tribunals-downloader&#34;]
  * module.demo-platform.azurerm_dns_a_record.this[&#34;toffee&#34;]
  * module.demo-platform.azurerm_dns_a_record.this[&#34;vh-wowza-public&#34;]
  * module.demo-platform.azurerm_dns_cname_record.this[&#34;_44cb36f0c4dde84c9ff1534180bb24da&#34;]
  * module.demo-platform.azurerm_dns_cname_record.this[&#34;afdverify.bulkscan&#34;]
  * module.demo-platform.azurerm_dns_cname_record.this[&#34;afdverify.cft-api-mgmt&#34;]
  * module.demo-platform.azurerm_dns_cname_record.this[&#34;afdverify.reformscan&#34;]
  * module.demo-platform.azurerm_dns_cname_record.this[&#34;afdverify.sds-api-mgmt&#34;]
  * module.demo-platform.azurerm_dns_cname_record.this[&#34;afdverify.vh-wowza&#34;]
  * module.demo-platform.azurerm_dns_cname_record.this[&#34;bulkscan&#34;]
  * module.demo-platform.azurerm_dns_cname_record.this[&#34;cft-api-mgmt&#34;]
  * module.demo-platform.azurerm_dns_cname_record.this[&#34;em9743.mail-prl-nonprod&#34;]
  * module.demo-platform.azurerm_dns_cname_record.this[&#34;reformscan&#34;]
  * module.demo-platform.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-prl-nonprod&#34;]
  * module.demo-platform.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-prl-nonprod&#34;]
  * module.demo-platform.azurerm_dns_cname_record.this[&#34;sds-api-mgmt&#34;]
  * module.demo-platform.azurerm_dns_txt_record.this[&#34;idam-web-public&#34;]
  * module.demo-platform.azurerm_dns_txt_record.this[&#34;pip-frontend&#34;]
  * module.demo-platform.azurerm_dns_zone.zone
  * module.demo-platform.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.demo-platform.azurerm_dns_a_record.this["pip-frontend"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pip-frontend"
      + records             = [
          + "20.108.232.218",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_a_record.this["tax-tribunals"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "tax-tribunals"
      + records             = [
          + "51.145.96.41",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_a_record.this["tax-tribunals-downloader"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "tax-tribunals-downloader"
      + records             = [
          + "51.145.96.41",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_a_record.this["toffee"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "toffee"
      + records             = [
          + "20.90.197.52",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_a_record.this["vh-wowza-public"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-wowza-public"
      + records             = [
          + "20.77.78.162",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_cname_record.this["_44cb36f0c4dde84c9ff1534180bb24da"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_44cb36f0c4dde84c9ff1534180bb24da"
      + record              = "56DDD5BB7BD629DD7B32C2EF75824ECB.4FDD1FE37015F188615E327886C95C9B.44e67a303e887000a548.comodoca.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_cname_record.this["afdverify.bulkscan"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.bulkscan"
      + record              = "afdverify.hmcts-demo.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_cname_record.this["afdverify.cft-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.cft-api-mgmt"
      + record              = "afdverify.hmcts-demo.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_cname_record.this["afdverify.reformscan"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.reformscan"
      + record              = "afdverify.hmcts-demo.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_cname_record.this["afdverify.sds-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.sds-api-mgmt"
      + record              = "afdverify.hmcts-demo.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_cname_record.this["afdverify.vh-wowza"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.vh-wowza"
      + record              = "afdverify.hmcts-demo.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_cname_record.this["bulkscan"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bulkscan"
      + record              = "hmcts-demo.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_cname_record.this["cft-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cft-api-mgmt"
      + record              = "hmcts-demo.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_cname_record.this["em9743.mail-prl-nonprod"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "em9743.mail-prl-nonprod"
      + record              = "u24999805.wl056.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_cname_record.this["reformscan"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformscan"
      + record              = "hmcts-demo.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_cname_record.this["s1._domainkey.mail-prl-nonprod"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "s1._domainkey.mail-prl-nonprod"
      + record              = "s1.domainkey.u24999805.wl056.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_cname_record.this["s2._domainkey.mail-prl-nonprod"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "s2._domainkey.mail-prl-nonprod"
      + record              = "s2.domainkey.u24999805.wl056.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_cname_record.this["sds-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-api-mgmt"
      + record              = "sdshmcts-demo.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.demo-platform.azurerm_dns_txt_record.this["idam-web-public"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-web-public"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "demo.platform.hmcts.net"

      + record {
          + value = "google-site-verification=eqMUm6VJdh4KEmuEJpRYRUe-Hmaee8GHf-pniuk7bLI"
        }
    }

  # module.demo-platform.azurerm_dns_txt_record.this["pip-frontend"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pip-frontend"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "demo.platform.hmcts.net"

      + record {
          + value = "20.108.232.218"
        }
    }

  # module.demo-platform.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "demo.platform.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformmgmtrg"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.demo-platform.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "893dc142-adad-4200-b1d0-30b257f7d7b4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 22 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":958,"Program":"tfcmt","SHA1":"","Target":"demo-uksouth-demo","Vars":{}} -->